lighttransport/gemm/common/sam3d_mesh_decoder.h
/*
 * sam3d_mesh_decoder.h - SAM3D learned SLAT mesh decoder, CPU path.
 *
 * Runs the mesh decoder checkpoint trunk (shared sparse transformer) plus
 * the two SparseSubdivideBlock3d upsample heads, then extracts a mesh
 * from the predicted per-cube SDF, deformation, FlexiCubes weights,
 * vertex RGB channels, and upstream DMC ambiguity check table. Marching
 * cubes remains as a fallback if the FlexiCubes-style extractor cannot
 * produce faces.
 */
#ifndef SAM3D_MESH_DECODER_H
#define SAM3D_MESH_DECODER_H

#include <stdint.h>
#include "sam3d_gs_decoder.h"
#include "marching_cubes.h"
#include "flexicubes_tables.h"

#ifdef __cplusplus
extern "C" {
#endif

typedef struct {
    qtensor gn_w, gn_b;
    qtensor conv1_w, conv1_b;
    qtensor gn2_w, gn2_b;
    qtensor conv2_w, conv2_b;
    qtensor skip_w, skip_b;
    int in_c;
    int out_c;
} sam3d_mesh_up_block;

typedef struct {
    sam3d_gs_decoder_model trunk;
    sam3d_mesh_up_block up[2];
    qtensor out_w, out_b;
    int out_channels;
    int mesh_res;
    st_context *st_ctx;
} sam3d_mesh_decoder_model;

sam3d_mesh_decoder_model *sam3d_mesh_decoder_load_safetensors(const char *path);
void sam3d_mesh_decoder_free(sam3d_mesh_decoder_model *m);

int sam3d_mesh_decoder_decode(const sam3d_mesh_decoder_model *m,
                              const int32_t *coords,
                              const float *feats,
                              int N, int C,
                              mc_mesh *out_mesh,
                              int n_threads);
int sam3d_mesh_decoder_decode_rgb(const sam3d_mesh_decoder_model *m,
                                  const int32_t *coords,
                                  const float *feats,
                                  int N, int C,
                                  mc_mesh *out_mesh,
                                  float **out_rgb,
                                  int n_threads);

#ifdef __cplusplus
}
#endif

#endif /* SAM3D_MESH_DECODER_H */

#ifdef SAM3D_MESH_DECODER_IMPLEMENTATION
#ifndef SAM3D_MESH_DECODER_IMPL_ONCE
#define SAM3D_MESH_DECODER_IMPL_ONCE

#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

static int s3dm_load_block(st_context *ctx, int i, sam3d_gs_block *b)
{
    char p[128];
#define FIND_(field, name) do { \
    snprintf(p, sizeof(p), "blocks.%d.%s", i, name); \
    if (qt_find(ctx, p, &b->field) != 0) return -1; \
} while (0)
    FIND_(attn_qkv_w, "attn.to_qkv.weight");
    FIND_(attn_qkv_b, "attn.to_qkv.bias");
    FIND_(attn_out_w, "attn.to_out.weight");
    FIND_(attn_out_b, "attn.to_out.bias");
    FIND_(mlp_fc1_w,  "mlp.mlp.0.weight");
    FIND_(mlp_fc1_b,  "mlp.mlp.0.bias");
    FIND_(mlp_fc2_w,  "mlp.mlp.2.weight");
    FIND_(mlp_fc2_b,  "mlp.mlp.2.bias");
#undef FIND_
    return 0;
}

static int s3dm_load_up(st_context *ctx, int i, sam3d_mesh_up_block *b)
{
    char p[160];
#define FIND_(field, name) do { \
    snprintf(p, sizeof(p), "upsample.%d.%s", i, name); \
    if (qt_find(ctx, p, &b->field) != 0) return -1; \
} while (0)
    FIND_(gn_w,    "act_layers.0.weight");
    FIND_(gn_b,    "act_layers.0.bias");
    FIND_(conv1_w, "out_layers.0.conv.weight");
    FIND_(conv1_b, "out_layers.0.conv.bias");
    FIND_(gn2_w,   "out_layers.1.weight");
    FIND_(gn2_b,   "out_layers.1.bias");
    FIND_(conv2_w, "out_layers.3.conv.weight");
    FIND_(conv2_b, "out_layers.3.conv.bias");
    FIND_(skip_w,  "skip_connection.conv.weight");
    FIND_(skip_b,  "skip_connection.conv.bias");
#undef FIND_
    b->in_c = b->gn_w.n_cols;
    b->out_c = b->conv2_b.n_cols;
    return b->in_c > 0 && b->out_c > 0 ? 0 : -1;
}

sam3d_mesh_decoder_model *sam3d_mesh_decoder_load_safetensors(const char *path)
{
    st_context *ctx = safetensors_open(path);
    if (!ctx) {
        fprintf(stderr, "sam3d_mesh_decoder: cannot open %s\n", path);
        return NULL;
    }
    sam3d_mesh_decoder_model *m = (sam3d_mesh_decoder_model *)calloc(1, sizeof(*m));
    if (!m) { safetensors_close(ctx); return NULL; }
    m->st_ctx = ctx;

    sam3d_gs_decoder_model *t = &m->trunk;
    t->st_ctx = ctx;
    t->dim = 768;
    t->n_heads = 12;
    t->head_dim = 64;
    t->in_channels = 8;
    t->resolution = 64;
    t->window_size = 8;
    t->mlp_ratio = 4.0f;
    t->ln_eps = 1e-5f;

    int rc = 0;
    rc |= qt_find(ctx, "input_layer.weight", &t->input_w);
    rc |= qt_find(ctx, "input_layer.bias",   &t->input_b);
    if (rc) { sam3d_mesh_decoder_free(m); return NULL; }

    int n_blocks = 0;
    for (int i = 0; i < 64; i++) {
        char p[128];
        snprintf(p, sizeof(p), "blocks.%d.attn.to_qkv.weight", i);
        if (safetensors_find(ctx, p) < 0) break;
        n_blocks = i + 1;
    }
    if (n_blocks <= 0) { sam3d_mesh_decoder_free(m); return NULL; }
    t->n_blocks = n_blocks;
    t->blocks = (sam3d_gs_block *)calloc((size_t)n_blocks, sizeof(sam3d_gs_block));
    if (!t->blocks) { sam3d_mesh_decoder_free(m); return NULL; }
    for (int i = 0; i < n_blocks; i++) {
        if (s3dm_load_block(ctx, i, &t->blocks[i]) != 0) {
            sam3d_mesh_decoder_free(m); return NULL;
        }
    }
    if (s3dm_load_up(ctx, 0, &m->up[0]) != 0 ||
        s3dm_load_up(ctx, 1, &m->up[1]) != 0 ||
        qt_find(ctx, "out_layer.weight", &m->out_w) != 0 ||
        qt_find(ctx, "out_layer.bias", &m->out_b) != 0) {
        sam3d_mesh_decoder_free(m); return NULL;
    }
    m->out_channels = m->out_b.n_cols;
    m->mesh_res = 256;
    fprintf(stderr,
            "sam3d_mesh_decoder: loaded %d blocks, up %d->%d->%d, out=%d res=%d\n",
            t->n_blocks, m->up[0].in_c, m->up[0].out_c, m->up[1].out_c,
            m->out_channels, m->mesh_res);
    return m;
}

void sam3d_mesh_decoder_free(sam3d_mesh_decoder_model *m)
{
    if (!m) return;
    free(m->trunk.blocks);
    if (m->st_ctx) safetensors_close(m->st_ctx);
    free(m);
}

static void s3dm_groupnorm32(float *dst, const float *src,
                             const qtensor *wq, const qtensor *bq,
                             int N, int C)
{
    const int G = 32;
    int group_c = C / G;
    const float *w = (const float *)wq->data;
    const float *b = (const float *)bq->data;
    for (int i = 0; i < N; i++) {
        const float *x = src + (size_t)i * C;
        float *y = dst + (size_t)i * C;
        for (int g = 0; g < G; g++) {
            int c0 = g * group_c;
            float mean = 0.0f;
            for (int c = 0; c < group_c; c++) mean += x[c0 + c];
            mean /= (float)group_c;
            float var = 0.0f;
            for (int c = 0; c < group_c; c++) {
                float d = x[c0 + c] - mean;
                var += d * d;
            }
            float inv = 1.0f / sqrtf(var / (float)group_c + 1e-5f);
            for (int c = 0; c < group_c; c++) {
                int k = c0 + c;
                y[k] = (x[k] - mean) * inv * w[k] + b[k];
            }
        }
    }
}

static sp3d_tensor *s3dm_subdivide(const sp3d_tensor *t)
{
    int N = t->N, C = t->C;
    int out_N = N * 8;
    int32_t *coords = (int32_t *)malloc((size_t)out_N * 4 * sizeof(int32_t));
    float *feats = (float *)malloc((size_t)out_N * C * sizeof(float));
    if (!coords || !feats) { free(coords); free(feats); return NULL; }
    int k = 0;
    for (int i = 0; i < N; i++) {
        int32_t b = t->coords[i * 4 + 0];
        int32_t z = t->coords[i * 4 + 1] * 2;
        int32_t y = t->coords[i * 4 + 2] * 2;
        int32_t x = t->coords[i * 4 + 3] * 2;
        for (int s = 0; s < 8; s++, k++) {
            coords[k * 4 + 0] = b;
            coords[k * 4 + 1] = z + ((s >> 2) & 1);
            coords[k * 4 + 2] = y + ((s >> 1) & 1);
            coords[k * 4 + 3] = x + (s & 1);
            memcpy(feats + (size_t)k * C, t->feats + (size_t)i * C,
                   (size_t)C * sizeof(float));
        }
    }
    sp3d_tensor *out = sp3d_create(coords, feats, out_N, C, t->batch_size);
    free(coords); free(feats);
    return out;
}

