lighttransport/gemm/common/sam3d_mesh_decoder.h
int sam3d_mesh_decoder_decode(const sam3d_mesh_decoder_model *m,
                              const int32_t *coords,
                              const float *feats,
                              int N, int C,
                              mc_mesh *out_mesh,
                              int n_threads)
{
    return sam3d_mesh_decoder_decode_rgb(m, coords, feats, N, C, out_mesh,
                                         NULL, n_threads);
}

int sam3d_mesh_decoder_decode_rgb(const sam3d_mesh_decoder_model *m,
                                  const int32_t *coords,
                                  const float *feats,
                                  int N, int C,
                                  mc_mesh *out_mesh,
                                  float **out_rgb,
                                  int n_threads)
{
    if (!m || !coords || !feats || N <= 0 || C != 8 || !out_mesh) return -1;
    memset(out_mesh, 0, sizeof(*out_mesh));
    if (out_rgb) *out_rgb = NULL;
    sp3d_tensor *x = sp3d_create(coords, feats, N, C, 1);
    if (!x) return -1;
    float *h = NULL;
    int rc = sam3d_gs_decoder_hidden_transformer(&m->trunk, x, &h, n_threads);
    sp3d_free(x);
    if (rc != 0 || !h) return -2;
    sp3d_tensor *t = sp3d_create(coords, h, N, m->trunk.dim, 1);
    free(h);
    if (!t) return -2;
    sp3d_tensor *u0 = s3dm_up_block(&m->up[0], t, n_threads);
    sp3d_free(t);
    if (!u0) return -3;
    sp3d_tensor *u1 = s3dm_up_block(&m->up[1], u0, n_threads);
    sp3d_free(u0);
    if (!u1) return -4;
    float *out = (float *)malloc((size_t)u1->N * m->out_channels * sizeof(float));
    if (!out) { sp3d_free(u1); return -5; }
    sp3d_linear(out, u1->feats, u1->N, &m->out_w, &m->out_b,
                m->out_channels, u1->C, n_threads);
    sp3d_tensor *cube_feats = sp3d_replace_feats(u1, out, m->out_channels);
    free(out); sp3d_free(u1);
    if (!cube_feats) return -5;
    rc = s3dm_sdf_mesh_from_features(m, cube_feats, out_mesh, out_rgb);
    sp3d_free(cube_feats);
    return rc;
}

#endif /* SAM3D_MESH_DECODER_IMPL_ONCE */
#endif /* SAM3D_MESH_DECODER_IMPLEMENTATION */
